//Todo: السكرين هنا بتكون استدعاء لويدجت المواعيد و الحجوزات
//الاشياء اللي بتكون ب السكرين هذي
//***************************************************

//Todo: App Bar

//***************************************************

//Todo:  تاب بار المواعيد و الهيلث ريكورد

//***************************************************

//Todo: in sup_features health recoerd : اتوقع بتكون داخلها ويدجت مو سكرييين استدعيها داخل التاب بار

//***************************************************


//Todo: in sup_features Appointment : اتوقع بتكون داخلها ويدجت مو سكرييين استدعيها داخل التاب بار ,بيكون فيه انتيتي و ريبو وداتابيس

//***************************************************

//Todo: in sup_features health recoerd & Appointment : مهم اسأل هل بيكون لهم كيوبت منفصل ولا لا